app/controllers/registrations_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "Bonjour@hotmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-02-16 13:43:27.902969"], ["updated_at", "2023-02-16 13:43:27.902969"]]